import { Link, useNavigate } from 'react-router-dom'
import cafe1 from '/news/cafe1.jpg'
import cafe2 from '/news/cafe2.jpg'
import cafe2_1 from '/news/cafe2-1.jpg'
import cafe2_2 from '/news/cafe2-2.jpg'
import cafe2_3 from '/news/cafe2-3.jpg'

import cafe3 from '../../assets/news/coffeeshop/Ura219/Ura2191.jpeg'
import article1 from '/news/article1.jpg'
import story1 from '/news/story1.png'
import story1_1 from '/news/story1_1.jpg'


// 資料區
export const articles = [
    {
        id: 1,
        title: '川先生｜明星咖啡館與那個年代：臺北文人的思想日常',
        content: '在1960年代末的台北街頭，思想的自由仍在重重邊界之中遊走。學運、文藝、國際思潮交織而來，卻在某些地方悄然發酵──那不是課堂，也不是報社，而是街角的咖啡館。像是「明星咖啡館」這樣的空間，對當時的文青而言，不只是喝咖啡的場所，而是一種「精神的流浪地」。他們窩在藤椅裡，口中談論薩特、卡繆與尼采，筆記本裡寫下詩句、政治抒懷、未完成的小說，試圖在那一壺濃黑之中釋放內心的幽微躁動。',
        image: story1,
        tag: '封面故事',
        author: 'Coco Huang',
        paragraphs: {
            p1: "隱身於大稻埕百年老宅的AKA café，因「不可參觀、需預約、不併桌、禁拍照」等嚴格規矩，讓不少人望之卻步。然而，一旦按下門鈴、隨著引導穿越窄巷入內，便能瞬間感受到空間裡沈積百年的光影與質感，彷彿走入過去富貴人家的日常場景。",
            p2: "AKA café 透過空間細節、氣味、光線等元素，無聲地述說著大稻埕昔日的輝煌與優雅，讓人猶如穿越百年時光，與老城記憶不期而遇。這樣的氛圍，也喚起了我們對曾經『最好的時光』的追憶與眷戀。",
            p3: "正如朱天文在《最好的時光》中所言：「最好的時光，是一種不再回返的幸福之感。」AKA café 所營造的感受，正是這種因永恆失落而倍感珍貴的懷舊情懷，讓空間成為記憶與時間的容器。",
            p4: "咖啡館的主理人 Neo 提到，這棟老宅過去是大稻埕富商郭烏隆的家宅，他以經營郭怡美商行致富，專營雜穀、麵粉與糖品。這處如今的咖啡館，曾是他位於迪化街與民樂街之間的宅邸，靜靜埋藏於城市一角，如同被時光遺忘的秘密。",
        },
        smImg: [story1_1, cafe2_2, cafe2_3],
    },
    {
        id: 2,
        title: '川先生｜那些年，台灣喝的咖啡是什麼味',
        content: '明清時期-零星摸索種植最早可推前至1624-1662年，當時少數荷蘭人早已悄悄引進咖啡樹，但僅限於荷蘭人自己飲用，不具有真正的商業價值與推廣意義。 下面敘述是最早可考據的文字紀錄，18世紀清光緒年間台灣開放商港後，英國「德記洋行」來台經商貿易，選擇從馬尼拉引進阿拉比卡品種， 種植區域主要於北部商港附近山區，包括現今新北市海山地區與台北市文山區，但短短三年時間，莊園因一把不明火炬整個燒光， 同時因北部緯度過高栽植過程水土不服，德記洋行因兩個主要原因選擇放棄。',
        image: article1,
        author: 'Coco Huang',
        paragraphs: {
            p1: "隱身於大稻埕百年老宅的AKA café，因「不可參觀、需預約、不併桌、禁拍照」等嚴格規矩，讓不少人望之卻步。然而，一旦按下門鈴、隨著引導穿越窄巷入內，便能瞬間感受到空間裡沈積百年的光影與質感，彷彿走入過去富貴人家的日常場景。",
            p2: "AKA café 透過空間細節、氣味、光線等元素，無聲地述說著大稻埕昔日的輝煌與優雅，讓人猶如穿越百年時光，與老城記憶不期而遇。這樣的氛圍，也喚起了我們對曾經『最好的時光』的追憶與眷戀。",
            p3: "正如朱天文在《最好的時光》中所言：「最好的時光，是一種不再回返的幸福之感。」AKA café 所營造的感受，正是這種因永恆失落而倍感珍貴的懷舊情懷，讓空間成為記憶與時間的容器。",
            p4: "咖啡館的主理人 Neo 提到，這棟老宅過去是大稻埕富商郭烏隆的家宅，他以經營郭怡美商行致富，專營雜穀、麵粉與糖品。這處如今的咖啡館，曾是他位於迪化街與民樂街之間的宅邸，靜靜埋藏於城市一角，如同被時光遺忘的秘密。",
            p5: "除了空間本身的故事，AKA café 在味覺上的講究也不容忽視。主理人特別邀請來自東京的咖啡職人 Yoshi 駐店，帶來如藝術品般的手沖單品咖啡體驗，其中「大稻埕」風味最具代表性。",
            p6: "Yoshi 使用 ORIGAMI 濾杯手工沖煮的「大稻埕」咖啡，蘊含著堅果與藥草香氣，溫潤又層次分明，搭配迪化街百年老店龍月堂的糕點，一口一口，品味的不只是精品咖啡，更是一段關於城市、歷史與記憶的生活方式。"
        },
        smImg: [cafe2_1, cafe2_2, cafe2_3],
    },
    {
        id: 3,
        title: '川先生｜地下藝文場景與思想解放',
        content: '牯嶺街口的老書店旁，一家新開的咖啡館成為學生口耳相傳的聚點。木質窗櫺內，是一群穿著寬鬆白襯衫、眼神堅定的青年。他們手中捧著黑咖啡與薄本小冊子，嘴裡念的是左岸的浪漫與東亞的未竟理想。這裡不是演講廳，卻句句有聲；不是抗議場，卻句句帶火。他們不喝甜膩的飲料，只要一壺苦澀的現煮，彷彿可以沖淡當時社會的壓抑。這樣的場所，不只是一間店，而是一場無聲的革命，在日常對話中默默成形。',
        image: article1,
        author: 'Coco Huang',
        paragraphs: {
            p1: "隱身於大稻埕百年老宅的AKA café，因「不可參觀、需預約、不併桌、禁拍照」等嚴格規矩，讓不少人望之卻步。然而，一旦按下門鈴、隨著引導穿越窄巷入內，便能瞬間感受到空間裡沈積百年的光影與質感，彷彿走入過去富貴人家的日常場景。",
            p2: "AKA café 透過空間細節、氣味、光線等元素，無聲地述說著大稻埕昔日的輝煌與優雅，讓人猶如穿越百年時光，與老城記憶不期而遇。這樣的氛圍，也喚起了我們對曾經『最好的時光』的追憶與眷戀。",
            p3: "正如朱天文在《最好的時光》中所言：「最好的時光，是一種不再回返的幸福之感。」AKA café 所營造的感受，正是這種因永恆失落而倍感珍貴的懷舊情懷，讓空間成為記憶與時間的容器。",
            p4: "咖啡館的主理人 Neo 提到，這棟老宅過去是大稻埕富商郭烏隆的家宅，他以經營郭怡美商行致富，專營雜穀、麵粉與糖品。這處如今的咖啡館，曾是他位於迪化街與民樂街之間的宅邸，靜靜埋藏於城市一角，如同被時光遺忘的秘密。",
            p5: "除了空間本身的故事，AKA café 在味覺上的講究也不容忽視。主理人特別邀請來自東京的咖啡職人 Yoshi 駐店，帶來如藝術品般的手沖單品咖啡體驗，其中「大稻埕」風味最具代表性。",
            p6: "Yoshi 使用 ORIGAMI 濾杯手工沖煮的「大稻埕」咖啡，蘊含著堅果與藥草香氣，溫潤又層次分明，搭配迪化街百年老店龍月堂的糕點，一口一口，品味的不只是精品咖啡，更是一段關於城市、歷史與記憶的生活方式。"
        },
        smImg: [cafe2_1, cafe2_2, cafe2_3],
    },    
];

export const hotArticles = [
    {
        id: 101,
        title: '大稻埕最美秘境，預約制老宅咖啡館AKA café！',
        content: 'AKA café 藏身於大稻埕的百年老宅中，老屋紅磚與現代設計交織出懷舊又摩登的氛圍。推開木門，陽光灑落在磨石子地板上，老傢俱搭配極簡美學，彷彿時光暫停。這裡不只是喝咖啡的地方，更像一場舊時光與當代品味的對話。',
        image: cafe1,
        author: 'Coco Huang',
        paragraphs: {
            p1: "隱身於大稻埕百年老宅的AKA café，因「不可參觀、需預約、不併桌、禁拍照」等嚴格規矩，讓不少人望之卻步。然而，一旦按下門鈴、隨著引導穿越窄巷入內，便能瞬間感受到空間裡沈積百年的光影與質感，彷彿走入過去富貴人家的日常場景。",
            p2: "AKA café 透過空間細節、氣味、光線等元素，無聲地述說著大稻埕昔日的輝煌與優雅，讓人猶如穿越百年時光，與老城記憶不期而遇。這樣的氛圍，也喚起了我們對曾經『最好的時光』的追憶與眷戀。",
            p3: "正如朱天文在《最好的時光》中所言：「最好的時光，是一種不再回返的幸福之感。」AKA café 所營造的感受，正是這種因永恆失落而倍感珍貴的懷舊情懷，讓空間成為記憶與時間的容器。",
            p4: "咖啡館的主理人 Neo 提到，這棟老宅過去是大稻埕富商郭烏隆的家宅，他以經營郭怡美商行致富，專營雜穀、麵粉與糖品。這處如今的咖啡館，曾是他位於迪化街與民樂街之間的宅邸，靜靜埋藏於城市一角，如同被時光遺忘的秘密。",
            p5: "除了空間本身的故事，AKA café 在味覺上的講究也不容忽視。主理人特別邀請來自東京的咖啡職人 Yoshi 駐店，帶來如藝術品般的手沖單品咖啡體驗，其中「大稻埕」風味最具代表性。",
            p6: "Yoshi 使用 ORIGAMI 濾杯手工沖煮的「大稻埕」咖啡，蘊含著堅果與藥草香氣，溫潤又層次分明，搭配迪化街百年老店龍月堂的糕點，一口一口，品味的不只是精品咖啡，更是一段關於城市、歷史與記憶的生活方式。"
        },
        smImg: [cafe2_1, cafe2_2, cafe2_3],

    },
    {
        id: 102,
        title: '種蘭花的溫室改造而成！大稻埕「小尾咖啡」隱身二樓老宅，明亮採光包覆空間',
        content: '前身為蘭花溫室的老宅空間改造，小尾咖啡由Allen與設計師筱婷合作打造，空間保留原貌，結合喫茶店元素與黑膠唱片、雜誌牆，成為充滿交流與個性的小隱秘境。樓中樓設計讓人有探索的趣味，傳遞對咖啡與空間的熱愛。',
        image: cafe2,
        author: '洪雅筠',
        paragraphs: {
            p1: "疫情過後的大稻埕風景變動頻繁，一些老店退出，一些新面孔進駐，但歷史與文化的厚度依然存在。就在台北橋邊，一棟屋齡六十年的老房子悄然轉變成咖啡館。主理人Allen與設計師筱婷，憑藉對老城區的熱愛與偶然的靈感，共同打造了『小尾咖啡』。",
            p2: "這間咖啡館前身是蘭花溫室，保留了半透明屋頂，日光灑落如同舊日午後的暖意。設計上保留原木結構與色調，重新整理管線、拓寬樓梯，並融入喫茶店元素如馬賽克磚、清水模，讓空間既懷舊又現代。小尾咖啡隱身於一樓摩托車改裝店之後，需先按門鈴、穿越店面才能抵達二樓的咖啡館。這段昏暗與明亮交替的過程，宛如一次都市探險，也因此讓空間多了一份神秘與私密的氛圍。",
            p3: "創店的契機來自一次意外的發現。筱婷原是在幫一樓店主整修空間，偶然踏上二樓後深受吸引。之後透過朋友牽線認識Allen，兩人雖無共事經驗，卻因共同理念而決定合作創業，各自的夢想在此交會。",
            p4: "空間配置刻意保留寬敞與安靜，座位不多，像是一座秘密基地。整面雜誌牆隨季節更換主題，黑膠唱片則依照兩人喜好挑選與更新，使這裡成為藝術與生活風格交流的平台。曾經他們也設想開放讓顧客播放自帶黑膠唱片，創造如同個人工作室般的自由感。然而考量到每人音樂風格差異，只能在理想與現實之間取得平衡，呈現最適合這個空間的音樂風景。",
        },
        smImg: [cafe2_1, cafe2_2, cafe2_3],
    },
    {
        id: 103,
        title: '隱身大稻埕迪化街的老宅秘境！「裏 Ura.219」',
        content: 'AKA café 「裏 Ura.219」結合服裝、陶藝、植物與茶屋的複合式空間，強調「痕跡」與「不完美」的美學。內部庭院融合日式禪意造景、枯山水步道及古物選品，強調歷史痕跡與生命流動，營造靜謐而充滿藝術氣息的空間體驗，呼應大稻埕的文化底蘊。',
        image: cafe3,
        author: 'Amber Chiu',
        paragraphs: {
            p1: "2022 年，『Merci 裏山』在台北陽明山開幕，結合溫室、植栽、老物與茶室等元素，營造出兼具藝文氣息與自然靜謐感的空間，吸引眾多風格人士造訪。到了 2023 年底，裏山與服裝品牌 Professor.E 攜手在大稻埕推出全新複合式空間『裏 Ura.219』，將服飾、塊根植物、咖啡、茶屋與古物美學融合，為熙攘的迪化街注入一抹安靜且深層的文化氣息。",
            p2: "『大稻埕傳遞的氛圍相當符合裏 Ura.219 的精神理念。』原來 Ken 早在兩年前便已租下這棟古宅作為品牌 Showroom，選址於這座蘊含歷史記憶的老城區，像是命中註定般的選擇。前棟空間陳列著 Professor.E、陶藝品牌 Objectby1218 以及多款古物選品，營造出現代與舊物交錯的場景。",
            p3: "Professor.E 的『Forgotten Materials』系列，以手工植物染、鐵鏽染、擦色等工藝呈現斑駁質感，與空間中老壁紙、手工塗料、褪色牆面相互映襯。這種斑駁並非隨意，而是一種被刻意保存的『痕跡』——品牌想要傳遞的不完美之美，也成為空間中最動人的視覺語言。",
            p4: "正如設計者所說：「與其說斑駁感，不如說是痕跡。」Professor.E 的設計講求材料與文化的層層堆疊，例如將中國廣州的香雲紗布料用於歐式西裝外套，即展現出衝突與融合之美，而這種矛盾交錯的語彙，也讓空間本身充滿了難以取代的個性。",
            p5: "走進中庭，由一攬芳華設計與裏山團隊聯手打造的天井庭院，參照枯山水鋪設碎石步道，周圍植栽錯落、樹影婆娑，呈現清幽的日式禪意氛圍。這片靜謐庭園不僅是通道，更是一個讓人停留、感受、沉靜下來的自然之境。",
            p6: "展示架上擺放著裏山選品的日本盆栽與 0343 Conservatory 的塊根植物，每一株綠意都帶著自然生命的痕跡與姿態。正如品牌所說：「植物是生命體，它的不確定性和變化正好體現時間的流動。」這些植物成為空間最生動的存在，也讓『裏 Ura.219』展現出強烈的生命力與靜謐並存的詩意美感。"
        },
        smImg: [cafe2_1, cafe2_2, cafe2_3],
    }
];

function Article() {
    const navigate = useNavigate();

    function onClickArea(id) {
        navigate(`/news/article/${id}`);
    }

    return (
        <>
            <div id='findArticles'>
                <h1 className='title'>閱讀文章</h1>

                <main id='article'>
                    <nav>
                        <div className='nav-news'>
                            <ul>
                                <li>
                                    <Link to="/news/article">閱讀文章</Link>
                                </li>
                                <li>
                                    <Link to="/news/event">找活動</Link>
                                </li>
                            </ul>

                        </div>
                    </nav>

                    {/* Section 1: 文章列表 */}

                    <section className="sec1">
                        {/* 關鍵字搜尋 */}
                        <div className="searchBar">
                            <input type="search" placeholder="請輸入關鍵字" />
                            {/* <button className='searchBtn'>搜尋</button> */}
                        </div>
                        {/* 每張卡片 */}
                        {articles.map((article) => (
                            <div
                                className="articleCard"
                                key={article.id}
                                onClick={() => onClickArea(article.id)}
                            >
                                <figure>
                                    <img src={article.image} alt={article.title} />
                                </figure>

                                <div className="articleCardText">
                                    <h1>{article.title}</h1>
                                    <p className="articleContent">{article.content}</p>
                                </div>
                            </div>
                        ))}

                        {/* 頁碼 */}
                        <div className="pageNumberArea">
                            <div>
                                <p>1</p>
                                <p>2</p>
                                <p>3</p>
                            </div>
                        </div>


                    </section>

                    {/* 人氣推薦 */}
                    <section className="sec2">
                        <h1 className='title'>Hotest｜人氣推薦</h1>
                        {/* 每張卡片 */}
                        {hotArticles.map((article) => (
                            <div className="articleCard"
                                key={article.id}
                                onClick={() => onClickArea(article.id)}
                            >
                                <img src={article.image} alt={article.title} />
                                <div className="articleCardText">
                                    <h1>{article.title}</h1>
                                    <p className="articleContent">{article.content}</p>
                                </div>
                            </div>
                        ))}

                    </section>

                    {/* TOP按鈕 */}

                    <div className="top-btn" onClick={() => window.scrollTo({ top: 0, behavior: 'smooth' })}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="49" height="62" viewBox="0 0 49 62" fill="none">
                            <path d="M48.479 5.23584C48.479 23.3317 48.479 41.4276 48.479 59.5234C48.1746 59.545 47.8811 59.5882 47.5767 59.5882C37.4332 59.6422 27.3006 59.7069 17.1571 59.7501C13.0258 59.7717 8.88364 59.7501 4.71971 59.7501C4.60012 59.2643 4.46967 58.854 4.39356 58.4329C3.26289 52.203 3.01282 45.9407 3.59991 39.6244C4.36094 31.3863 6.91583 23.8176 12.1126 17.2638C13.0041 16.1409 13.2433 15.0072 13.1672 13.582C13.0367 11.1958 13.1998 8.79886 13.2433 6.33714C14.8958 7.69756 16.233 8.89604 17.679 9.94335C18.6901 10.6884 19.8643 10.656 21.1254 10.4184C24.4957 9.7814 27.8877 9.0256 31.3015 8.89604C34.5413 8.77727 37.8137 9.39271 41.0644 9.72742C42.3364 9.85698 43.4671 9.97574 44.489 8.86365C45.7176 7.55721 47.1418 6.43431 48.479 5.23584ZM21.7994 22.1872C20.647 22.1332 19.4511 21.8957 18.6249 23.0402C17.4398 24.6813 17.9399 27.8665 19.6468 28.9246C21.332 29.9611 23.2128 30.0043 24.9523 29.1621C26.6157 28.3523 27.4202 26.8299 27.518 24.9944C27.605 23.4181 26.9636 22.6947 25.398 22.5003C24.2021 22.36 22.9953 22.2844 21.7994 22.1872ZM29.2575 38.5879C32.4104 38.5231 35.2588 37.7134 37.705 35.7375C38.1942 35.3488 38.6726 34.8521 38.9335 34.2907C39.314 33.4593 38.89 32.8007 38.0964 32.4012C37.1832 31.9369 37.194 32.7467 36.9005 33.2218C36.6396 33.6429 36.259 34.0748 35.8133 34.2799C34.5413 34.8737 33.2475 35.5 31.8885 35.8455C29.5946 36.4285 27.2789 36.1802 25.0066 35.4892C24.5935 35.3704 24.0825 35.5863 23.615 35.6511C23.7781 36.1802 23.8107 36.7956 24.126 37.1951C24.4087 37.5622 24.9849 37.7889 25.4741 37.8969C26.7244 38.1884 27.9964 38.372 29.2575 38.5879ZM38.6291 24.962C38.6182 23.2885 37.618 21.9605 36.3895 22.0037C35.2914 22.0468 34.4978 23.2345 34.5087 24.8109C34.5304 26.3549 35.4436 27.4886 36.6939 27.4994C37.9007 27.4994 38.6291 26.5384 38.6291 24.962Z" fill="#A46230" />
                            <path d="M48.4782 4.31049C47.141 5.51976 45.7168 6.64265 44.4992 7.95989C43.4772 9.07199 42.3465 8.95322 41.0745 8.82366C37.8238 8.48895 34.5514 7.87352 31.3116 7.99229C27.9087 8.11106 24.5058 8.87764 21.1355 9.51467C19.8635 9.7522 18.7002 9.7738 17.6891 9.0396C16.2431 7.98149 14.9059 6.78302 13.2534 5.43339C13.2099 7.89511 13.0468 10.2921 13.1773 12.6782C13.2534 14.1034 13.0142 15.2371 12.1227 16.36C6.91507 22.9138 4.37105 30.4717 3.61002 38.7207C3.02294 45.037 3.27298 51.2992 4.40366 57.5291C4.47976 57.9502 4.59936 58.3605 4.72982 58.8464C8.90462 58.8464 13.0359 58.8572 17.1673 58.8464C27.3107 58.8032 37.4433 58.7384 47.5868 58.6844C47.8912 58.6844 48.1847 58.6412 48.4891 58.6196C48.4891 59.559 48.4891 60.5091 48.4891 61.4485C36.6279 61.524 24.7667 61.5888 12.9163 61.6644C10.7637 61.6752 8.60021 61.6752 6.44758 61.7292C3.35997 61.8048 2.35975 61.1246 1.79442 58.1554C-0.129907 48.0385 -0.0320673 37.9757 2.92508 28.0532C4.28407 23.5076 6.50194 19.3508 9.40473 15.561C10.144 14.5893 10.3071 13.6068 10.3288 12.3759C10.3614 9.56866 10.7528 6.77222 11.0572 3.97579C11.1225 3.40354 11.4378 2.8421 11.7313 2.32384C12.4706 0.985007 13.7426 0.823049 14.808 1.92435C15.2538 2.38862 15.5799 2.95006 15.9822 3.45753C16.428 4.02977 16.8628 4.6236 17.3629 5.14186C18.6132 6.4591 19.9287 7.02055 21.9183 6.4699C28.1696 4.74238 34.5296 4.89354 40.8788 6.05962C41.716 6.21078 42.3248 6.1352 42.9771 5.50897C44.7818 3.79224 46.6518 2.15108 48.5 0.477539C48.4783 1.73 48.4782 3.01485 48.4782 4.31049Z" fill="white" />
                            <path d="M21.7976 21.2617C22.9935 21.3697 24.2003 21.4345 25.3962 21.5748C26.9618 21.7584 27.6032 22.4818 27.5162 24.0689C27.4184 25.8936 26.6138 27.4268 24.9505 28.2366C23.2001 29.0896 21.3301 29.0356 19.645 27.9991C17.9272 26.941 17.438 23.7558 18.623 22.1147C19.4384 20.9702 20.6343 21.1969 21.7976 21.2617Z" fill="white" />
                            <path d="M29.2558 37.6626C27.9947 37.4359 26.7226 37.2523 25.4724 36.9716C24.9831 36.8636 24.4178 36.6369 24.1243 36.2698C23.809 35.8703 23.7655 35.2441 23.6133 34.7258C24.0808 34.661 24.5917 34.4451 25.0049 34.5639C27.2771 35.2441 29.5819 35.5032 31.8868 34.9202C33.2458 34.5747 34.5395 33.9484 35.8115 33.3546C36.2464 33.1494 36.6378 32.7176 36.8987 32.2965C37.1923 31.8106 37.1814 31.0116 38.0946 31.4759C38.8883 31.8754 39.3123 32.5448 38.9318 33.3654C38.6817 33.916 38.1925 34.4127 37.7032 34.8122C35.2571 36.7881 32.4195 37.5978 29.2558 37.6626Z" fill="white" />
                            <path d="M38.6295 24.0366C38.6404 25.6129 37.9011 26.5739 36.7052 26.5739C35.4549 26.5631 34.5417 25.4402 34.52 23.8854C34.4982 22.3198 35.3027 21.1214 36.4008 21.0782C37.6076 21.035 38.6187 22.363 38.6295 24.0366Z" fill="white" />
                        </svg>
                    </div>


                </main>

            </div>
        </>

    )
}
export default Article