import { Link, useNavigate } from 'react-router-dom'
import cafe1 from '/news/cafe1.jpg'
import cafe2 from '../../assets/news/coffeeshop/Tinytailcoffee/1.jpg'
import cafe3 from '../../assets/news/coffeeshop/Ura219/Ura2191.jpeg'
import article1 from '/news/article1.jpg'

// 資料區
export const articles = [
    {
        id: 1,
        title: '明星咖啡館與那個年代：台北文人的思想日常',
        content: '在1960年代末的台北街頭，思想的自由仍在重重邊界之中遊走。學運、文藝、國際思潮交織而來，卻在某些地方悄然發酵──那不是課堂，也不是報社，而是街角的咖啡館。像是「明星咖啡館」這樣的空間，對當時的文青而言，不只是喝咖啡的場所，而是一種「精神的流浪地」。他們窩在藤椅裡，口中談論薩特、卡繆與尼采，筆記本裡寫下詩句、政治抒懷、未完成的小說，試圖在那一壺濃黑之中釋放內心的幽微躁動。',
        image: article1
    },
    {
        id: 2,
        title: '台灣咖啡興衰史',
        content: '明清時期-零星摸索種植最早可推前至1624-1662年，當時少數荷蘭人早已悄悄引進咖啡樹，但僅限於荷蘭人自己飲用，不具有真正的商業價值與推廣意義。 下面敘述是最早可考據的文字紀錄，18世紀清光緒年間台灣開放商港後，英國「德記洋行」來台經商貿易，選擇從馬尼拉引進阿拉比卡品種， 種植區域主要於北部商港附近山區，包括現今新北市海山地區與台北市文山區，但短短三年時間，莊園因一把不明火炬整個燒光， 同時因北部緯度過高栽植過程水土不服，德記洋行因兩個主要原因選擇放棄。',
        image: article1
    },
    {
        id: 3,
        title: '地下藝文場景與思想解放',
        content: '牯嶺街口的老書店旁，一家新開的咖啡館成為學生口耳相傳的聚點。木質窗櫺內，是一群穿著寬鬆白襯衫、眼神堅定的青年。他們手中捧著黑咖啡與薄本小冊子，嘴裡念的是左岸的浪漫與東亞的未竟理想。這裡不是演講廳，卻句句有聲；不是抗議場，卻句句帶火。他們不喝甜膩的飲料，只要一壺苦澀的現煮，彷彿可以沖淡當時社會的壓抑。這樣的場所，不只是一間店，而是一場無聲的革命，在日常對話中默默成形。',
        image: article1
    }
];

export const hotArticles = [
    {
        id: 101,
        title: '大稻埕最美秘境，預約制老宅咖啡館AKA café！',
        content: 'AKA café 藏身於大稻埕的百年老宅中，老屋紅磚與現代設計交織出懷舊又摩登的氛圍。推開木門，陽光灑落在磨石子地板上，老傢俱搭配極簡美學，彷彿時光暫停。這裡不只是喝咖啡的地方，更像一場舊時光與當代品味的對話。',
        image: cafe1,
        author: 'Coco Huang',
        paragraphs: {
            p1: "不能參觀、必需預約、不任併桌，一但入內，還請輕聲細語，且不能拍照……隱身於大稻埕百年老宅裡的AKA café，以條列的規矩，嚇退了一堆人。",
            p2: "但按下門鈴、隨著帶領、穿越窄巷，進入空間的瞬間，原本不解、甚或有點埋怨的心立刻被馴服，因為空間以時光積累、獨特的美，訴說著它過往的輝煌，讓我們就像穿越時空，來到百年前迪化街富貴人家裡坐客般獨特情懷。",
            p3: "大稻埕百年宅邸AKA café，以空間細節、氣味光線……再再召喚著大稻埕曾經的美好時光，穿越百年，與我們相遇。",
            p4: "也讓我想起朱天文的電影劇本《最好的時光》寫著：「什麼是最好的時光？一種不再回返的幸福之感。不是因為它美好無匹所以我們眷念不已，而是倒過來，是因為它永恆失落了，我們只能用懷念召喚它，所以它才成為美好無匹。」",
            p5: "而以隨意姿態坐在綠意庭院的空間主理人Neo說起老屋，這裡的確曾經是失落在時間之中的美好：「這裡過去是大稻埕富商、郭怡美商行店主郭烏隆的宅邸。」",
            p6: "因開設郭怡美商行，經營雜穀、麵粉、糖等批發生意而致富的郭烏隆，據說在迪化街有好幾棟房子，而這個宛如失落在時間之中的美麗秘境，就夾在迪化街郭怡美商行與民樂街民宅之間。",
            p7: "除了空間，在味蕾上的感受也格外講究。特別邀來東京咖啡職人Yoshi先生進駐，提供單品咖啡的細膩享受，其中手工咖啡「大稻埕」最為迷人。",
            p8: "獨特烘焙的「大稻埕」單品咖啡，經Yoshi使用ORIGAMI濾杯如藝術般手工沖煮，展現就像大稻埕般耐人回味的豐富風情，堅果、藥草香竟巧妙地蘊含其中，再佐一塊迪化街老店龍月堂的糕點，優雅品味的不僅僅是杯職人咖啡，更是一段已遠逝的百年生活風格，與拾回一段消失在歷史之中的美好時光。"
        },

    },
    {
        id: 102,
        title: '種蘭花的溫室改造而成！大稻埕「小尾咖啡」隱身二樓老宅，明亮採光包覆空間',
        content: '前身為蘭花溫室的老宅空間改造，小尾咖啡由Allen與設計師筱婷合作打造，空間保留原貌，結合喫茶店元素與黑膠唱片、雜誌牆，成為充滿交流與個性的小隱秘境。樓中樓設計讓人有探索的趣味，傳遞對咖啡與空間的熱愛。',
        image: cafe2,
        author: '洪雅筠',
        paragraphs: {
            p1: "經過疫情，被咖啡廳簇擁著的大稻埕，一些店家離開了，一些新店開了，這裡的風景不斷改變，但歷史底蘊依舊。",
            p2: "去年十月，在大稻埕尾端一座位於台北橋邊的二層老房，小尾咖啡的主理人Allen與小事工事的室內設計師筱婷攜手在這棟登記屋齡六十年的房子裡開起了咖啡館，沒有多遠大的抱負，只因為喜歡這座舊城，而這個空間給了他們「命定」的感覺。",
            p3: "「小尾咖啡」前身是一座種蘭花的溫室，半透明的屋頂質料，讓日光篩落，一地陽光恣意地充斥在空間裡，還有著棉被曬過暖陽的味道。",
            p4: "格局如舊，並沒有進行大動作修改，使用原本的色調進行搭配，保留舊的木行架，但將管線重整、樓梯拓寬，並在設計上融入喫茶店的元素，如馬賽克磚，清水模等，悉心地構築出這間「店中店」咖啡廳。",
            p5: "初來乍到，應該不少人都會對小尾咖啡的位置感到疑惑：是另有樓梯？還是應該大膽地走進一樓店面裡？",
            p6: "在這個店中店的配置中，需先按下門鈴，開門後走入一樓的摩托車改裝店的店面至底，便能看見上二樓的樓梯，有點陡，但走上去後就是小尾咖啡真正的所在。",
            p7: "一連串昏暗與明亮的漸變過程，像是探索，也因為這種不易找到的感覺，讓這裡更散發一種小隱於市的氛圍。",
            p8: "「我覺得開咖啡廳的夢想大家都有，只是偶然遇見這個空間後，我就覺得可以拿它來做點什麼。」",
            p9: "聊到承租這個空間的契機，筱婷說是因為一樓的老闆本為自己先前的業主，當時在幫忙整理空間的過程中，不小心走了上來，覺得實在太酷了。",
            p10: "「這裡是室內，但明亮的採光又讓你感覺置身戶外，一開始沒有預設要開什麼店，但覺得這個空間已經深深地吸引了我。」",
            p11: "更妙的是，Allen、筱婷兩人本互不認識，剛好在這個時間點，藉由朋友的朋友牽起了線，就決定一起攜手開店。",
            p12: "從旁人來看，這是一個大膽的決定，彼此沒有共事的經驗，也不是長年相處的朋友。",
            p13: "但筱婷說，「我欣賞Allen對咖啡的熱情，再加上當時很多線都串在了一起，我想幫做好咖啡的人開一間店，而我自己的夢想就是希望有一座自己的秘密基地。」",
            p14: "這也是為什麼小尾的座位數刻意規劃不多的原因。",
            p15: "溫室般的環境寫出了小尾的個性，空間中放入的元素，也讓這裡成為意識交流的場域。",
            p16: "整面的雜誌牆以季更換主題，藝術、設計、生活風格等，黑膠唱片則是兩人依照喜好進行的挑選，也會定期更換。",
            p17: "本來筱婷更大膽設想，讓客人將自己喜歡的黑膠拿來放，讓他們有種身處在自己的工作室裡的自在感。",
            p18: "但受限於每人音樂喜好的不同等各種因素，只能在理想與現實中取得平衡。"
        }
    },
    {
        id: 103,
        title: '隱身大稻埕迪化街的老宅秘境！「裏 Ura.219」',
        content: 'AKA café 「裏 Ura.219」結合服裝、陶藝、植物與茶屋的複合式空間，強調「痕跡」與「不完美」的美學。內部庭院融合日式禪意造景、枯山水步道及古物選品，強調歷史痕跡與生命流動，營造靜謐而充滿藝術氣息的空間體驗，呼應大稻埕的文化底蘊。',
        image: cafe3,
        author: 'Amber Chiu',
        paragraphs: {
            p1: "2022 年開幕於台北陽明山的「Merci 裏山」，這個結合了溫室、植栽、老物件與茶室的藝文空間，吸引不少風雅人士們慕名前往。",
            p2: "2023 年底，裏山與服裝品牌 Professor.E 共同展開全新複合式空間「裏 Ura.219」，將服裝、塊根、盆栽、咖啡和茶屋合而為一，替熙攘的大稻埕迪化街添上一抹靜謐景色。",
            p3: "「大稻埕傳遞的氛圍相當符合『裏 Ura.219』精神理念。」",
            p4: "原來 Ken 在兩年前就已經租下這棟古宅做為品牌 Showroom，選擇落腳這樣一個充滿歷史底蘊的城區似乎是命中注定。",
            p5: "前棟空間販售著服裝品牌 Professor.E 與陶藝品牌 Objectby1218 及各式古物老件選品。",
            p6: "Professor.E 的「Forgotten Materials」系列為手工打造的植物染色、塗刷、擦色，當中實驗性的鐵鏽染與店裡台式老壁紙和手工塗料堆疊出斑駁的牆面相得益彰。",
            p7: "處處讓人感受到「裏 Ura.219」所鍾情的這種「不完美」質感。",
            p8: "「與其說斑駁感，不如說是『痕跡』，Professor.E 是一個層層堆疊的概念，像新系列我們用了中國廣州的香雲紗布料做一件歐式西裝外套，而這些衝突元素的堆疊概念，會產生不完美的斑駁感。」",
            p9: "那些承載痕跡是最吸引人的特點，也讓「不完美」成為難以取代的獨特之美。",
            p10: "步入中庭，由一攬芳華設計與裏山造景團隊施做的天井庭院，仿效枯山水的碎石路鋪往內館，周遭則呈現清奇又具禪意的日式庭園空間。",
            p11: "陳列於架上的是來自裏山的日本盆栽以及 0343 Conservatory 塊根植物，有了綠意點綴，古城區的老屋樓更顯生機。",
            p12: "「相比服裝與古物，植物是生命體，生命體的每種姿態都耐人尋味。」",
            p13: "而這種不確定性鋪陳出每個方位不同的獨特景致，反映出萬物更迭的痕跡，讓整體環境更具生命力。"
        }
    }
];

function Article() {
    const navigate = useNavigate();

    function onClickArea(id) {
        navigate(`/news/article/${id}`);
    }

    return (
        <>
            <div id='findArticles'>
                <h1 className='title'>閱讀文章</h1>

                <main id='article'>
                    <nav>
                        <div className='nav-news'>
                            <ul>
                                <li>
                                    <Link to="/news/article">閱讀文章</Link>
                                </li>
                                <li>
                                    <Link to="/news/event">找活動</Link>
                                </li>
                            </ul>

                        </div>
                    </nav>

                    {/* Section 1: 文章列表 */}

                    <section className="sec1">
                        {/* 關鍵字搜尋 */}
                        <div className="searchBar">
                            <input type="search" placeholder="請輸入關鍵字" />
                            {/* <button className='searchBtn'>搜尋</button> */}
                        </div>
                        {/* 每張卡片 */}
                        {articles.map((article) => (
                            <div
                                className="articleCard"
                                key={article.id}
                                onClick={() => onClickArea(article.id)}
                            >
                                <figure>
                                    <img src={article.image} alt={article.title} />
                                </figure>

                                <div className="articleCardText">
                                    <h1>{article.title}</h1>
                                    <p className="articleContent">{article.content}</p>
                                </div>
                            </div>
                        ))}

                        {/* 頁碼 */}
                        <div className="pageNumberArea">
                            <div>
                                <p>1</p>
                                <p>2</p>
                                <p>3</p>
                            </div>
                        </div>


                    </section>

                    {/* 人氣推薦 */}
                    <section className="sec2">
                        <h1 className='title'>Hotest｜人氣推薦</h1>
                        {/* 每張卡片 */}
                        {hotArticles.map((article) => (
                            <div className="articleCard"
                                key={article.id}
                                onClick={() => onClickArea(article.id)}
                            >
                                <img src={article.image} alt={article.title} />
                                <div className="articleCardText">
                                    <h1>{article.title}</h1>
                                    <p className="articleContent">{article.content}</p>
                                </div>
                            </div>
                        ))}

                    </section>

                    {/* TOP按鈕 */}

                    <div className="top-btn" onClick={() => window.scrollTo({ top: 0, behavior: 'smooth' })}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="49" height="62" viewBox="0 0 49 62" fill="none">
                            <path d="M48.479 5.23584C48.479 23.3317 48.479 41.4276 48.479 59.5234C48.1746 59.545 47.8811 59.5882 47.5767 59.5882C37.4332 59.6422 27.3006 59.7069 17.1571 59.7501C13.0258 59.7717 8.88364 59.7501 4.71971 59.7501C4.60012 59.2643 4.46967 58.854 4.39356 58.4329C3.26289 52.203 3.01282 45.9407 3.59991 39.6244C4.36094 31.3863 6.91583 23.8176 12.1126 17.2638C13.0041 16.1409 13.2433 15.0072 13.1672 13.582C13.0367 11.1958 13.1998 8.79886 13.2433 6.33714C14.8958 7.69756 16.233 8.89604 17.679 9.94335C18.6901 10.6884 19.8643 10.656 21.1254 10.4184C24.4957 9.7814 27.8877 9.0256 31.3015 8.89604C34.5413 8.77727 37.8137 9.39271 41.0644 9.72742C42.3364 9.85698 43.4671 9.97574 44.489 8.86365C45.7176 7.55721 47.1418 6.43431 48.479 5.23584ZM21.7994 22.1872C20.647 22.1332 19.4511 21.8957 18.6249 23.0402C17.4398 24.6813 17.9399 27.8665 19.6468 28.9246C21.332 29.9611 23.2128 30.0043 24.9523 29.1621C26.6157 28.3523 27.4202 26.8299 27.518 24.9944C27.605 23.4181 26.9636 22.6947 25.398 22.5003C24.2021 22.36 22.9953 22.2844 21.7994 22.1872ZM29.2575 38.5879C32.4104 38.5231 35.2588 37.7134 37.705 35.7375C38.1942 35.3488 38.6726 34.8521 38.9335 34.2907C39.314 33.4593 38.89 32.8007 38.0964 32.4012C37.1832 31.9369 37.194 32.7467 36.9005 33.2218C36.6396 33.6429 36.259 34.0748 35.8133 34.2799C34.5413 34.8737 33.2475 35.5 31.8885 35.8455C29.5946 36.4285 27.2789 36.1802 25.0066 35.4892C24.5935 35.3704 24.0825 35.5863 23.615 35.6511C23.7781 36.1802 23.8107 36.7956 24.126 37.1951C24.4087 37.5622 24.9849 37.7889 25.4741 37.8969C26.7244 38.1884 27.9964 38.372 29.2575 38.5879ZM38.6291 24.962C38.6182 23.2885 37.618 21.9605 36.3895 22.0037C35.2914 22.0468 34.4978 23.2345 34.5087 24.8109C34.5304 26.3549 35.4436 27.4886 36.6939 27.4994C37.9007 27.4994 38.6291 26.5384 38.6291 24.962Z" fill="#A46230" />
                            <path d="M48.4782 4.31049C47.141 5.51976 45.7168 6.64265 44.4992 7.95989C43.4772 9.07199 42.3465 8.95322 41.0745 8.82366C37.8238 8.48895 34.5514 7.87352 31.3116 7.99229C27.9087 8.11106 24.5058 8.87764 21.1355 9.51467C19.8635 9.7522 18.7002 9.7738 17.6891 9.0396C16.2431 7.98149 14.9059 6.78302 13.2534 5.43339C13.2099 7.89511 13.0468 10.2921 13.1773 12.6782C13.2534 14.1034 13.0142 15.2371 12.1227 16.36C6.91507 22.9138 4.37105 30.4717 3.61002 38.7207C3.02294 45.037 3.27298 51.2992 4.40366 57.5291C4.47976 57.9502 4.59936 58.3605 4.72982 58.8464C8.90462 58.8464 13.0359 58.8572 17.1673 58.8464C27.3107 58.8032 37.4433 58.7384 47.5868 58.6844C47.8912 58.6844 48.1847 58.6412 48.4891 58.6196C48.4891 59.559 48.4891 60.5091 48.4891 61.4485C36.6279 61.524 24.7667 61.5888 12.9163 61.6644C10.7637 61.6752 8.60021 61.6752 6.44758 61.7292C3.35997 61.8048 2.35975 61.1246 1.79442 58.1554C-0.129907 48.0385 -0.0320673 37.9757 2.92508 28.0532C4.28407 23.5076 6.50194 19.3508 9.40473 15.561C10.144 14.5893 10.3071 13.6068 10.3288 12.3759C10.3614 9.56866 10.7528 6.77222 11.0572 3.97579C11.1225 3.40354 11.4378 2.8421 11.7313 2.32384C12.4706 0.985007 13.7426 0.823049 14.808 1.92435C15.2538 2.38862 15.5799 2.95006 15.9822 3.45753C16.428 4.02977 16.8628 4.6236 17.3629 5.14186C18.6132 6.4591 19.9287 7.02055 21.9183 6.4699C28.1696 4.74238 34.5296 4.89354 40.8788 6.05962C41.716 6.21078 42.3248 6.1352 42.9771 5.50897C44.7818 3.79224 46.6518 2.15108 48.5 0.477539C48.4783 1.73 48.4782 3.01485 48.4782 4.31049Z" fill="white" />
                            <path d="M21.7976 21.2617C22.9935 21.3697 24.2003 21.4345 25.3962 21.5748C26.9618 21.7584 27.6032 22.4818 27.5162 24.0689C27.4184 25.8936 26.6138 27.4268 24.9505 28.2366C23.2001 29.0896 21.3301 29.0356 19.645 27.9991C17.9272 26.941 17.438 23.7558 18.623 22.1147C19.4384 20.9702 20.6343 21.1969 21.7976 21.2617Z" fill="white" />
                            <path d="M29.2558 37.6626C27.9947 37.4359 26.7226 37.2523 25.4724 36.9716C24.9831 36.8636 24.4178 36.6369 24.1243 36.2698C23.809 35.8703 23.7655 35.2441 23.6133 34.7258C24.0808 34.661 24.5917 34.4451 25.0049 34.5639C27.2771 35.2441 29.5819 35.5032 31.8868 34.9202C33.2458 34.5747 34.5395 33.9484 35.8115 33.3546C36.2464 33.1494 36.6378 32.7176 36.8987 32.2965C37.1923 31.8106 37.1814 31.0116 38.0946 31.4759C38.8883 31.8754 39.3123 32.5448 38.9318 33.3654C38.6817 33.916 38.1925 34.4127 37.7032 34.8122C35.2571 36.7881 32.4195 37.5978 29.2558 37.6626Z" fill="white" />
                            <path d="M38.6295 24.0366C38.6404 25.6129 37.9011 26.5739 36.7052 26.5739C35.4549 26.5631 34.5417 25.4402 34.52 23.8854C34.4982 22.3198 35.3027 21.1214 36.4008 21.0782C37.6076 21.035 38.6187 22.363 38.6295 24.0366Z" fill="white" />
                        </svg>
                    </div>


                </main>

            </div>
        </>

    )
}
export default Article